//=========================================
// 
// ゲーム内処理
// Author YudaKaito
// 
//=========================================
//------------------------------------
// include
//------------------------------------
#include "game.h"
#include "main.h"
#include "input.h"
#include "camera.h"
#include "light.h"
#include "fade.h"
#include "debug.h"
#include "sound.h"
#include <stdio.h>

//------------------------------------
// 定義
//------------------------------------
namespace
{

}

//------------------------------------
// 静的変数
//------------------------------------
namespace
{

}

//=========================================
// 初期化
//=========================================
void InitGame(void)
{

}

//=========================================
// 終了
//=========================================
void UninitGame(void)
{

}

//=========================================
// 更新
//=========================================
void UpdateGame(void)
{

}

//=========================================
// 描画
//=========================================
void DrawGame()
{
	LPDIRECT3DDEVICE9 pDevice = GetDevice();	//デバイスの取得

	SetCamera();	// カメラ

	// 2Dの前に3Dを置く
	pDevice->Clear(0, NULL, (D3DCLEAR_ZBUFFER), D3DCOLOR_RGBA(0, 0, 0, 0), 1.0f, 0);

	/* ↓2Dの上に置きたい3D描画↓ */
}

//=========================================
// ポーズの設定処理
//=========================================
void SetEnablePause(bool bUse)
{

}

//=========================================
// ポーズの状態を取得
//=========================================
bool GetPause(void)
{
	return false;
}
