//=========================================
//
// リザルト処理
// Author:Yuda Kaito
//
//=========================================
//------------------------------------
// include
//------------------------------------
#include "result.h"
#include "input.h"
#include "fade.h"
#include "sound.h"
#include "camera.h"
#include "light.h"

//------------------------------------
// マクロ定義
//------------------------------------

//=========================================
// 静的変数変数
//=========================================

//=========================================
// 初期化
//=========================================
void InitResult(void)
{
	// 初期化処理
	InitCamera();		// カメラ
	InitLight();		// ライト
}

//=========================================
// リザルトの終了処理
//=========================================
void UninitResult(void)
{
	StopSound();

	UninitCamera();		// カメラ
	UninitLight();		// ライト
}

//=========================================
// リザルトの更新処理
//=========================================
void UpdateResult(void)
{
	// 更新処理
	UpdateLight();			// ライト
}

//=========================================
// リザルトの描画処理
//=========================================
void DrawResult()
{
	LPDIRECT3DDEVICE9 pDevice = GetDevice();	//デバイスの取得

	// 画面クリア(バックバッファ＆Zバッファのクリア)
	pDevice->Clear(0, NULL, (D3DCLEAR_TARGET | D3DCLEAR_ZBUFFER), D3DCOLOR_RGBA(0, 0, 0, 0), 1.0f, 0);

	// 描画処理
	SetCamera();		// カメラ
}
