//=========================================
// 
// タイトルの処理
// Author YudaKaito
// 
//=========================================
//-----------------------------------------
// include
//-----------------------------------------
// 主要ヘッダー
#include "title.h"
#include "input.h"
#include "sound.h"
#include "mode.h"
// 処理ヘッダー
#include "player.h"
// 描画ヘッダー
#include "camera.h"
#include "light.h"
#include "rectangle3D.h"
#include "rectangle2D.h"
#include "color.h"
// DEBUGヘッダー
#include <assert.h>

//-----------------------------------------
// マクロ定義
//-----------------------------------------

//-----------------------------------------
// 静的変数
//-----------------------------------------
bool s_bExit = false;	// ゲーム自体の終了フラグ

//=========================================
// 初期化処理
//=========================================
void InitTitle(void)
{
}

//=========================================
// 終了処理
//=========================================
void UninitTitle(void)
{

}

//=========================================
// 更新処理
//=========================================
void UpdateTitle(void)
{
	if (GetKeyboardTrigger(DIK_RETURN))
	{
		ChangeMode(MODE_GAME);
	}
}

//=========================================
// 選択処理
//=========================================
void SelectTitle(void)
{

}

//=========================================
// 描画処理
//=========================================
void DrawTitle(void)
{
	SetCamera();		// カメラ
	DrawRectangle3D();	// 矩形(3D)
	DrawRectangle();	// 矩形(2D)
}

//=========================================
// 終了情報を取得
//=========================================
bool GetExit(void)
{
	return s_bExit;
}
